PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
/*
 * Slave (Implant) - Implantable Device Application
 *
 * Ultra-low power operation: kimagu 2023.10.13
 *   1. MCU in Stop 2 mode (~2 uA)
 *   2. CC2500 in WOR mode (periodic RX sniff at 2.4 GHz)
 *   3. CC2500 GDO0 -> EXTI wakes MCU on beacon detection
 *   4. CC1101 is powered down until communication session
 *
 * Communication flow (Slave never initiates):
 *   1. CC2500 WOR detects wake-up beacon -> GDO0 EXTI -> MCU wakes
 *   2. Parse beacon, remember SESS + assigned MICS CHANNEL (chosen by Master
 *      via LBT before the beacon was sent)
 *   3. CC2500 sends wake-up ACK echoing DEVICE_ID+SESS+CHANNEL
 *   4. CC1101 tunes directly to the assigned MICS channel (no scanning)
 *   5. CC1101 responds to Master commands filtered by SESS + DEVICE_ID
 *   6. CC1101 powers down, CC2500 re-enters WOR, MCU -> Stop 2
 *
 * MCU: STM32U575 Q-series
 * Radios: CC2500 (2.4 GHz WOR wake-up), CC1101 (400 MHz MICS data)
 */

#include "cc1101.h"
#include "cc2500.h"
#include "protocol.h"
#include "stm32u575_lowpower.h"
#include <string.h>

#define AUTH_NONCE_LEN 4U
#define AUTH_TAG_LEN   4U
#define AUTH_ARG_LEN   (AUTH_NONCE_LEN + AUTH_TAG_LEN)
#define STREAM_CFG_SUBCMD 0x01U
#define STREAM_LOGICAL_DATA_MAX 17U
#define STREAM_FEC_COPIES 5U

/* ---------- low-power tuning knobs ---------- */
#define SLAVE_RTC_WAKEUP_INTERVAL_S   300U  /* raise to reduce periodic wakeups */

/* ---------- ship mode (long-term storage / transport) ----------
* CC2500 WOR off; both radios SPWD; MCU Stop 3 (~1 µA).
* RTC period lengthens with ship time to limit battery use on long storage;
* auto-exit to NORMAL after SLAVE_SHIP_MAX_ELAPSED_SEC (default 365 days).
* WKUP pin still forces immediate exit to NORMAL.
*
* Schedule (g_ship_elapsed_sec since CMD_SHIP, updated each RTC wake):
*   [0, 2h)     → wake every 5 min
*   [2h, 3h)   → every 30 min
*   [3h, 30d)  → every 1 h
*   [30d, 60d) → every 2 h
*   [60d, 365d)→ every 3 h
*   ≥ 365d     → auto-exit NORMAL (radios + Stop 2 beacon path restored) */
#define SLAVE_SHIP_SEC_5MIN           300U
#define SLAVE_SHIP_SEC_30MIN          1800U
#define SLAVE_SHIP_SEC_1H             3600U
#define SLAVE_SHIP_SEC_2H             7200U
#define SLAVE_SHIP_SEC_3H             10800U
/* End of “5 min interval” phase; default 2 h (then 30 min until SLAVE_SHIP_PHASE_30MIN_END_SEC). */
#ifndef SLAVE_SHIP_PHASE_5MIN_END_SEC
#define SLAVE_SHIP_PHASE_5MIN_END_SEC   (2U * 3600U)
#endif
#define SLAVE_SHIP_PHASE_30MIN_END_SEC  (3U * 3600U)       /* switch to 1 h at 3 h */
#define SLAVE_SHIP_PHASE_1H_END_SEC     (30U * 86400U)     /* switch to 2 h at 30 d */
#define SLAVE_SHIP_PHASE_2H_END_SEC     (60U * 86400U)     /* switch to 3 h at 60 d */
#define SLAVE_SHIP_MAX_ELAPSED_SEC      (365U * 86400U)   /* auto-exit at 365 d */
/* HAL `PWR_WAKEUP_PINx_*` constant — must match CubeMX WKUP pin (default PA0 = WKUP1). */
#ifndef SLAVE_SHIP_WKUP_HAL_PIN
#define SLAVE_SHIP_WKUP_HAL_PIN        PWR_WAKEUP_PIN1_HIGH_0
#endif

typedef enum {
   SLAVE_RUN_NORMAL = 0U,  /* beacon-wait: CC2500 WOR + Stop 2 (default) */
   SLAVE_RUN_SHIP   = 1U,  /* storage:     CC2500/CC1101 Sleep + Stop 3  */
} SlavePowerProfile;

/* ---------- power trace (debugger-readable) ---------- */
typedef struct {
   uint32_t stop2_entries;
   uint32_t wakeup_exti_count;
   uint32_t wakeup_rtc_count;
   uint32_t wakeup_ok_count;
   uint32_t wakeup_fail_count;
   uint32_t mics_session_count;
   uint32_t mics_timeout_count;
   uint32_t last_stop2_enter_ms;
   uint32_t last_stop2_exit_ms;
   uint32_t last_session_start_ms;
   uint32_t last_session_end_ms;
   /* ship mode counters */
   uint32_t ship_entries;          /* times Stop3 ship sleep was entered */
   uint32_t ship_rtc_wakeup_count; /* RTC wakes while in ship mode */
} Slave_PowerTrace;

volatile Slave_PowerTrace g_slave_pwr_trace = {0};

/* ---------- hardware handles ---------- */
static CC1101_HandleTypeDef g_cc1101;
static CC2500_HandleTypeDef g_cc2500;
static LP_HandleTypeDef     g_lp;

/* These would be defined by CubeMX-generated code */
extern SPI_HandleTypeDef hspi1;
extern SPI_HandleTypeDef hspi2;
extern RTC_HandleTypeDef hrtc;

/* ---------- device identity ---------- */
static const uint8_t g_my_id[PROTO_DEVICE_ID_LEN] = {0x00, 0x00, 0x00, 0x01};

/* ---------- authorised Master identity (factory-paired) ----------
* This Slave accepts wake-up / COMMAND frames ONLY if they carry this
* MASTER_ID in the payload. Provisioned at the factory during pairing
* with a specific Programmer. Rejecting frames from unauthorised
* Masters mitigates the trivial spoof attack where an attacker who
* learns the DEVICE_ID could otherwise wake the implant at will.
*
* NOTE: This is a pre-shared identifier, not a cryptographic key.
* Strong authentication (HMAC / signatures / nonce-based freshness)
* must be layered on top at the application level if the threat
* model requires it. */
static const uint8_t g_authorized_master_id[PROTO_MASTER_ID_LEN] =
   {0xAA, 0xBB, 0xCC, 0xDD};

/* ---------- session state ---------- */
static volatile bool g_wakeup_flag       = false;
static volatile bool g_cc1101_gdo0_flag  = false; /* set in EXTI ISR when CC1101 GDO0 asserts */

/* ---------- ship mode runtime state ---------- */
static SlavePowerProfile g_power_profile  = SLAVE_RUN_NORMAL;
/* Cumulative ship time (sum of RTC sleep intervals); approximates wall time in ship. */
static uint32_t g_ship_elapsed_sec       = 0U;
static uint32_t g_ship_last_interval_sec = 0U; /* last LP_ConfigureRTCWakeUp(seconds) */
static uint8_t g_seq = 0U;
static uint8_t g_session_id     = PROTO_SESS_UNASSIGNED; /* assigned by Master wake-up */
static uint8_t g_active_channel = PROTO_CHANNEL_UNASSIGNED; /* MICS channel carried in beacon */
static uint8_t g_last_rx_seq = 0U;
static bool    g_last_rx_seq_valid = false;
static uint8_t g_session_nonce[AUTH_NONCE_LEN] = {0};
static bool    g_stream_enabled = false;
static uint8_t g_stream_interval_ms = 20U;
static uint8_t g_stream_remaining_frames = 0U;
static uint8_t g_stream_seq = 0U;

static const uint8_t g_auth_key[16] = {
   0x3A, 0x5C, 0x19, 0xE7, 0xA2, 0x4D, 0x77, 0x10,
   0x91, 0x2B, 0xC4, 0x6E, 0x58, 0xFD, 0x03, 0xAB
};

