PAKHYUNMOON/CC1101_CC2500/app/slave/s_main.c
   case CMD_DATA_WRITE:
   {
       /* DATA_WRITE args profile (runtime stream config):
        *   args[0] = STREAM_CFG_SUBCMD (0x01)
        *   args[1] = interval_ms
        *   args[2] = frame_count
        */
       uint8_t status = PROTO_STATUS_ERR_UNKNOWN_CMD;
       if (req->payload_len >= (uint8_t)(PROTO_CMD_ARGS_OFFSET + 3U)) {
           const uint8_t *args = &req->payload[PROTO_CMD_ARGS_OFFSET];
           if (args[0] == STREAM_CFG_SUBCMD) {
               uint8_t iv = args[1];
               uint8_t fc = args[2];
               g_stream_interval_ms = (iv == 0U) ? 20U : iv;
               g_stream_remaining_frames = fc;
               status = PROTO_STATUS_OK;
           }
       }
       slave_build_cmd_response(resp, CMD_DATA_ACK, &status, 1U);
       break;
   }

   case CMD_SLEEP_CMD:
       slave_build_cmd_response(resp, CMD_SLEEP_ACK, NULL, 0U);
       break;

   case CMD_SHIP_CMD:
   {
       /* Authenticated ship-mode entry: require the same nonce/MAC as
        * other session commands so an attacker cannot force the implant
        * into storage mode via a spoofed packet. */
       if (!Slave_VerifyCmdAuthAndStoreNonce(req)) {
           uint8_t st = PROTO_STATUS_ERR_ID_MISMATCH;
           slave_build_cmd_response(resp, CMD_SHIP_ACK, &st, 1U);
           break;
       }
       /* Transition is deferred until after the ACK is transmitted
        * (Slave_HandleRxPacket ends the session on CMD_SHIP_CMD). */
       g_power_profile          = SLAVE_RUN_SHIP;
       g_ship_elapsed_sec       = 0U;
       g_ship_last_interval_sec = 0U;
       slave_build_cmd_response(resp, CMD_SHIP_ACK, NULL, 0U);
       break;
   }

   case CMD_KEEPALIVE:
       slave_build_cmd_response(resp, CMD_KEEPALIVE_ACK, NULL, 0U);
       break;

   default:
   {
       uint8_t st = PROTO_STATUS_ERR_UNKNOWN_CMD;
       slave_build_cmd_response(resp, CMD_DATA_ACK, &st, 1U);
       break;
   }
   }

   return 0;
}

static void Slave_SendResponse(const Proto_Packet *resp, uint8_t channel)
{
   uint8_t tx_buf[CC1101_PKT_MAX_LEN];
   uint8_t tx_len = Proto_BuildPacket(resp, tx_buf, sizeof(tx_buf));
   if (tx_len == 0U) {
       return;
   }

   /* Slave responds on the channel Master selected (Master already cleared
    * it via LBT). Use SendPacketLBT with threshold=-120 dBm so the CCA
    * always passes (effectively direct send). */
   (void)CC1101_SendPacketLBT(&g_cc1101, channel,
                              tx_buf, tx_len,
                              -120, 1U, 200U);
}

/* Validate and dispatch one received MICS command packet.
* Returns true if the session should terminate (SLEEP_CMD received). */
static bool Slave_HandleRxPacket(const uint8_t *rx_buf, uint8_t rx_len)
{
   Proto_Packet req_pkt, resp_pkt;

   if (Proto_ParsePacket(rx_buf, rx_len, &req_pkt) < 0) {
       return false;
   }
   if (!Proto_MatchSession(req_pkt.sess, g_session_id)) {
       return false;
   }
   if (g_last_rx_seq_valid && !Proto_IsSeqNewer(req_pkt.seq, g_last_rx_seq)) {
       return false; /* replay/duplicate/out-of-order */
   }
   g_last_rx_seq = req_pkt.seq;
   g_last_rx_seq_valid = true;

   if (Proto_FCF_Type(req_pkt.fcf) != MICS_FCF_TYPE_COMMAND) {
       return false;
   }
   if ((req_pkt.payload_len < PROTO_CMD_HEADER_LEN) ||
       (req_pkt.payload[PROTO_CMD_DTYPE_OFFSET] != MICS_DTYPE_COMMAND)) {
       return false;
   }

   /* Triple-verify the handoff from 2.4 GHz wake-up:
    *   - SESS (already matched above)
    *   - DEVICE_ID in payload offset 2..5
    *   - MASTER_ID in payload offset 6..9
    * DEVICE_ID proves the Master still knows whom it woke up.
    * MASTER_ID proves this is the same authorised Master that
    * initiated the wake-up (and not a concurrent Master guessing
    * the SESS). Silently drop unauthenticated COMMAND frames so
    * the attacker gains no side-channel signal. */
   if (!Proto_VerifyPayloadDeviceID(&req_pkt,
                                    PROTO_CMD_DEVID_OFFSET,
                                    g_my_id)) {
       return false;
   }
   if (!Proto_VerifyPayloadMasterID(&req_pkt,
                                    PROTO_CMD_MASTERID_OFFSET,
                                    g_authorized_master_id)) {
       return false;
   }

   Slave_ProcessCommand(&req_pkt, &resp_pkt);
   Slave_SendResponse(&resp_pkt, g_active_channel);

   if (req_pkt.payload_len < PROTO_CMD_HEADER_LEN) {
       return false;
   }
   uint8_t end_cmd = req_pkt.payload[PROTO_CMD_SUBCMD_OFFSET];
   /* Both SLEEP and SHIP commands terminate the MICS session immediately
    * after the ACK is sent.  For SHIP, g_power_profile was already set to
    * SLAVE_RUN_SHIP inside Slave_ProcessCommand() so the next deep-sleep
    * entry will dispatch to Slave_EnterShipSleep(). */
   return (end_cmd == CMD_SLEEP_CMD) || (end_cmd == CMD_SHIP_CMD);
}

static int Slave_HandleMICSSession(void)
{
   uint8_t rx_buf[CC1101_PKT_MAX_LEN];
   uint8_t rx_len = 0U;
   bool session_active = true;

   g_slave_pwr_trace.mics_session_count++;
   g_slave_pwr_trace.last_session_start_ms = HAL_GetTick();

   /* Guard: a valid channel must have been assigned in the wake-up beacon */
   if (g_active_channel >= CC1101_MICS_NUM_CHANNELS) {
       return -1;
   }

   /* Initialize CC1101 for MICS communication */
   CC1101_WakeFromSleep(&g_cc1101);
   CC1101_InitMICSLike26MHz(&g_cc1101);

   /* CC2500 is not needed during active 400 MHz session.
    * Put it into deep sleep to cut parallel radio current. */
   (void)CC2500_EnterSleep(&g_cc2500);

   while (session_active) {
       if (g_stream_enabled) {
           /*
            * Stream mode with Stop 2 + ms-precision RTC wakeup.
            *
            * Problem with HAL_GetTick(): SysTick stops in Stop 2, so ms
            * timing cannot rely on it.  HAL_GetTick() and busy-polling are
            * therefore replaced here too.
            *
            * Solution — LP_ConfigureRTCWakeUp_ms():
            *   RTCCLK/16 = 32768/16 = 2048 Hz → ~488 µs/tick.
            *   stream_interval_ms=20 → count=41 ticks → 41/2048 ≈ 20 ms.
            *   MCU sleeps in Stop 2 for exactly one stream period per loop
            *   iteration instead of spinning at 4 MHz for 50 ms windows.
            *
            * Wakeup semantics per iteration:
            *   RTC fires (g_cc1101_gdo0_flag==false): stream interval elapsed
            *     → send stream fragments; CC1101 auto-returns to RX (MCSM1
            *     TXOFF→RX) so no explicit CC1101_EnterRx is needed mid-session.
            *   CC1101 GDO0 fires (g_cc1101_gdo0_flag==true): command arrived
            *     mid-stream → read and process; both events can fire in the
            *     same wakeup (RTC during TX completion window).
            *
            * Session timeout: accumulated elapsed ms replaces HAL_GetTick().
            */
           uint32_t stream_elapsed_ms = 0U;

           while (g_stream_enabled && session_active) {
               LP_ConfigureRTCWakeUp_ms(&g_lp, (uint32_t)g_stream_interval_ms);

